receiver/app/controllers/video_signals_controller.rb

  def index
    @video_signals = VideoSignal.all
---
SELECT `video_signals`.* FROM `video_signals`

    def set_video_signal
      @video_signal = VideoSignal.find(params[:id])
---
SELECT `video_signals`.* FROM `video_signals` WHERE `video_signals`.`id` = 0 LIMIT 1